flying4fun/ESP8266_APA102_chair/src/main.cpp
#include <Arduino.h>
#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPmDNS.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESP8266mDNS.h>
#endif
#include <ESPAsyncWiFiManager.h>
#include <ArduinoOTA.h>

#include "html_strings.h"

#include "EEPROM.h"
#define FASTLED_ALL_PINS_HARDWARE_SPI
#define ESP8266_SPI
//#define FASTLED_ESP8266_RAW_PIN_ORDER
#include "FastLED.h"

#define buttonPin 0                                           // input pin to use as a digital input
#include "jsbutton.h"                                         // Nice button routine by Jeff Saltzman

// Fixed definitions cannot change on the fly.
#define LED_DT 13                                             // Data pin to connect to the strip.
#define LED_CK 14                                             // Clock pin for WS2801 or APA102.
#define COLOR_ORDER BGR                                       // It's GRB for WS2812 and BGR for APA102.
#define LED_TYPE APA102                                       // Using APA102, WS2812, WS2801. Don't forget to modify LEDS.addLeds to suit.
#define NUM_LEDS 144                                          // Number of LED's.
#define DEBUG true

// Definition for the array of routines to display.
#define ARRAY_SIZE(A) (sizeof(A) / sizeof((A)[0]))

void fadeall(void);
void snakey(void);
void colorbands(void);
void bouncingball(void);
void flashusa(void);
void flashfade(void);
void confetti(void);
void blipouts(void);
void rainbow(void);
void rainbowWithGlitter(void);
void addGlitter(fract8 chanceOfGlitter);
void bpm(void);
void white(void);
void cylon(void);
void landinglight(void);
void fireball(void);
void pulse(void);
void racer(void);
void juggle(void);
void bandcracker(void);
void bandcracker2(void);
void police(void);
void burstfade(void);
void dropsslide(void);
void Fire2012WithPalette(void);
void risingwater(void);
void fallingwater(void);
void readbutton();

MDNSResponder mdns;
DNSServer dnsServer;
AsyncWebServer webServer(80);
AsyncWiFiManager wifiManager(&webServer, &dnsServer);

const uint8_t gamma8[] = {
    0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
    0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  1,  1,  1,
    1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  2,  2,
    2,  3,  3,  3,  3,  3,  3,  3,  4,  4,  4,  4,  4,  5,  5,  5,
    5,  6,  6,  6,  6,  7,  7,  7,  7,  8,  8,  8,  9,  9,  9, 10,
   10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 16, 16,
   17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 24, 24, 25,
   25, 26, 27, 27, 28, 29, 29, 30, 31, 32, 32, 33, 34, 35, 35, 36,
   37, 38, 39, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50,
   51, 52, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 66, 67, 68,
   69, 70, 72, 73, 74, 75, 77, 78, 79, 81, 82, 83, 85, 86, 87, 89,
   90, 92, 93, 95, 96, 98, 99,101,102,104,105,107,109,110,112,114,
  115,117,119,120,122,124,126,127,129,131,133,135,137,138,140,142,
  144,146,148,150,152,154,156,158,160,162,164,167,169,171,173,175,
  177,180,182,184,186,189,191,193,196,198,200,203,205,208,210,213,
  215,218,220,223,225,228,231,233,236,239,241,244,247,249,252,255 };

//Mode and EEPROM variables
uint8_t maxMode = 20;                                          // Maximum number of display modes. Would prefer to get this another way, but whatever.
int eepaddress = 0;

// Global variables can be changed on the fly.
uint8_t max_bright = 255;                                     // Overall brightness definition. It can be changed on the fly.
uint8_t speed = 50;
uint8_t dropSize = NUM_LEDS/8;
uint8_t eyeSize = NUM_LEDS/2;
uint8_t tR;
uint8_t tG;
uint8_t tB;
uint8_t gCurrentPatternNumber = 0;                            // Index number of which pattern is current
uint8_t gHue = 0;                                             // rotating "base color" used by many of the patterns
uint8_t gSat = 0;                                             // rotating "saturation value"
uint8_t gBrt = 0;                                             // rotating "brightness value"
uint8_t colorR = 0;
uint8_t colorG = 0;
uint8_t colorB = 0;

int16_t movingled = 0;                                       // variables for moving up and down the LED chain
int16_t movingledA = 0;
int16_t movingledB = 0;
int16_t movingledC = 0;
int16_t movingledD = 0;
int16_t movingledE = 0;
int16_t movingledF = 0;

uint16_t locationA = 0;
uint16_t locationB = 0;

uint32_t timerA = 0;
uint32_t timerB = 0;

byte mode = 0;

bool bBounce = 0;
bool bWipe = 0;
bool bLed = 0;
bool bLedA = 0;
bool bLedB = 0;
bool bLedC = 0;
bool bLedD = 0;
bool bLedE = 0;
bool policeCar = 0;
bool bounceA = 0;
bool bounceB = 0;
bool risingLevel = 0;

struct CRGB leds[NUM_LEDS];                                   // Initialize our LED array.
CRGBPalette16 gPal;

byte pulseA = 0;

typedef void (*SimplePatternList[])();                        // List of patterns to cycle through.  Each is defined as a separate function below.
SimplePatternList gPatterns = {fadeall, snakey, colorbands, bouncingball, flashusa,
  flashfade, confetti, blipouts, rainbow, rainbowWithGlitter, bpm, white, cylon,
  landinglight, fireball, pulse, racer, juggle, bandcracker, bandcracker2, police,
  burstfade, dropsslide, Fire2012WithPalette, risingwater, fallingwater };

long amap(long x, long in_min, long in_max, long out_min, long out_max)
{
  return (x - in_min) * (out_max - out_min + 1) / (in_max - in_min + 1) + out_min;
}


void setup() {
  Serial.begin(115200);
  pinMode(buttonPin, INPUT);                                  // Set button input pin
  digitalWrite(buttonPin, HIGH );
  randomSeed(analogRead(0));

  gPal = CRGBPalette16( CRGB::Black, CRGB::Red, CRGB::Yellow, CRGB::White);

  Serial.println("Booting");
  Serial.println("Free Heap: " + String(ESP.getFreeHeap()));

  Serial.println("Connecting to WiFi.");
  wifiManager.autoConnect();

  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  LEDS.addLeds<LED_TYPE, LED_DT, LED_CK, COLOR_ORDER>(leds, NUM_LEDS);  // Use this for APA102
  //LEDS.addLeds<LED_TYPE, LED_DT, COLOR_ORDER>(leds, NUM_LEDS);  // Use this for WS2812

