flying4fun/ESP8266_APA102_chair/src/main.cpp
  FastLED.setBrightness(max_bright);
  set_max_power_in_volts_and_milliamps(5, 5000);               // FastLED Power management set at 5V, 500mA.

  gCurrentPatternNumber = EEPROM.read(eepaddress);

  if (gCurrentPatternNumber > maxMode) gCurrentPatternNumber = 0;   // A safety in case the EEPROM has an illegal value.


  Serial.print("Starting ledMode: ");
  Serial.println(gCurrentPatternNumber);

  //gCurrentPatternNumber = 16;


  // Port defaults to 8266
  // ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[ChipID]
  // ArduinoOTA.setHostname("myesp8266");

  // No authentication by default
  // ArduinoOTA.setPassword("admin");

  // Password can be set with it's md5 value as well
  // MD5(admin) = 21232f297a57a5a743894a0e4a801fc3
  // ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");
  ArduinoOTA.setHostname("FastChair");
  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH)
      type = "sketch";
    else // U_SPIFFS
      type = "filesystem";

    // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("  Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed");
  });
  ArduinoOTA.begin();
  Serial.println("Setup of OTA complete");
  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());


  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send_P( 200, "text/html", tab_manual );
  });

  webServer.on("/power", HTTP_POST, [](AsyncWebServerRequest *request) {
    Serial.print("Set Power: ");
    Serial.print(request->argName(0));
    Serial.print(" = ");
    Serial.println(request->arg(request->argName(0)));
    if(request->args() > 0) {
      if(request->arg("value") == "0") {
        Serial.println("Power OFF");
        // fastled code to power off
      } else {
        Serial.println("Power ON");
        // fastled code to power on
      }
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/palette", HTTP_POST, [](AsyncWebServerRequest *request) {
    if(request->args() > 0) {
      Serial.print("Set Color: ");
      Serial.println(request->arg("value"));

      int r, g, b;
      sscanf(request->arg("value").c_str(), "%02x%02x%02x", &r, &g, &b);
      colorR = r;
      colorG = g;
      colorB = b;
      // fastled code to set color using r, g, b
      //for (uint16_t i = 0; i <= NUM_LEDS; i++) {
      //  leds[i] = CRGB(r, g, b);
      //}
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/brightness", HTTP_POST, [](AsyncWebServerRequest *request) {
    if(request->args() > 0) {
      //Serial.println(request->argName(0));
      Serial.print("Set Brightness: ");
      Serial.print(request->arg("value"));
      Serial.print(" [");
      Serial.print(amap(request->arg("value").toInt(), 0, 100, 0, 255));
      Serial.println("]");
      FastLED.setBrightness(amap(request->arg("value").toInt(), 0, 100, 0, 255));
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/program", HTTP_POST, [](AsyncWebServerRequest *request) {
    if(request->args() > 0) {
      Serial.print("Set Program: ");
      Serial.println(request->arg("value"));

      gCurrentPatternNumber = request->arg("value").toInt();
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/speed", HTTP_POST, [](AsyncWebServerRequest *request) {
    if(request->args() > 0) {
      Serial.print("Set Speed: ");
      Serial.println(request->arg("value"));

      speed = request->arg("value").toInt();
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/value", HTTP_POST, [](AsyncWebServerRequest *request) {
    if(request->args() > 0) {
      Serial.print("Set Value: ");
      Serial.println(request->arg("value"));
    }
    request->send_P( 200, "text/html", "" );
  });

  webServer.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P( 200, "text/html", "");
    Serial.println("favicon.ico requested");
  });

  webServer.onNotFound([](AsyncWebServerRequest *request){
    request->send(404);
  });

  webServer.begin();
}

void loop() {
  readbutton();
  ArduinoOTA.handle();                      // Listen for OTA requests

  gPatterns[gCurrentPatternNumber]();                       // Call the current pattern function once, updating the 'leds' array
  FastLED.show();
}


void readbutton() {                                           // Read the button and increase the mode

  uint8_t b = checkButton();

  if (b == 1) {                                               // Just a click event to advance to next pattern
    gCurrentPatternNumber = (gCurrentPatternNumber + 1) % ARRAY_SIZE(gPatterns);
    if (gCurrentPatternNumber == 0) {
      gCurrentPatternNumber = (gCurrentPatternNumber + 1) % ARRAY_SIZE(gPatterns);
    }
    Serial.println(gCurrentPatternNumber);
    bWipe = 1;                                                 // Global mode change boolean
  }

  if (b == 2) {                                               // A double-click event to reset to pattern 0
    gCurrentPatternNumber = 0;
    Serial.println(gCurrentPatternNumber);
  }

  if (b == 3) {                                               // A hold event to write current pattern to EEPROM
    EEPROM.write(eepaddress, gCurrentPatternNumber);
    Serial.print("Writing: ");
    Serial.println(gCurrentPatternNumber);
  }

} // readbutton()




//--------------------[ Effects are below here ]------------------------------------------------------------------------------

void rainbow() {

