flying4fun/ESP8266_APA102_chair/src/main.cpp
  fadesparkle();

  if (bBounce == 0) {
    leds[movingled] = CRGB::Orange;
    //leds[movingled] = CHSV(gHue++, 255, 255);
    if (movingled > 0) {
      leds[movingled - 1].nscale8(80);
    }
    //j+random8(5);
    j=random8(5);
    if ((random8() < i) && ((movingled - j) >= 0)) {
      movingledB = (movingled - j);
      leds[ movingledB ] = CRGB::Tan;
    }
    movingled++;
    if (movingled == (NUM_LEDS-1)) {
      bBounce = 1;
    }
  }
  // Now go in the other direction.
  else {
    leds[movingled] = CRGB::Orange;
    //leds[movingled] = CHSV(gHue++, 255, 255);
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled + 1].nscale8(80);
    }
    //j+random8(5);
    j=random8(5);
    if ((random8() < i) && ((movingled + j) < NUM_LEDS)) {
      movingledB = (movingled + j);
      leds[ movingledB ] = CRGB::Tan;
    }
    movingled--;
    if (movingled == 0) {
      bBounce = 0;
    }
  }
} // fireball()



void juggle() {                                               // Eight colored dots, weaving in and out of sync with each other.

  fadeToBlackBy(leds, NUM_LEDS, 20);
  byte dothue = 0;

  for(int i = 0; i < 8; i++) {
    leds[beatsin16(i+7,0,(NUM_LEDS-1))] |= CHSV(dothue, 200, 255);
    dothue += 32;
  }
} // juggle()



void cylon() {
  uint8_t eyeSize = NUM_LEDS / 5;
  //uint8_t tempBrt;
  //gHue = 0;
  //gSat = 255;
  //gBrt = 255;
  //tempBrt = gBrt;

  //EVERY_N_MILLISECONDS(speed) {
  /*
  if ( bBounce == 0 ) {
    if((NUM_LEDS/50) > 1)
      movingled += (NUM_LEDS/50);
    else
      movingled++;
    if ( movingled >= (NUM_LEDS - 1) ) {
      bBounce = 1;
      movingled = (NUM_LEDS - 1);
    }
  } else {
    if((NUM_LEDS/50) > 1 )
      movingled -= (NUM_LEDS/50);
    else
      movingled--;
    if ( movingled <= 0 ) {
      bBounce = 0;
      movingled = 0;
    }
  }

  black();
  leds[movingled] = CHSV(gHue, gSat, gBrt);

  for( int i = movingled+1; i < (movingled+1)+(eyeSize/2); i++ ) {
    if( i < NUM_LEDS ) {
      tempBrt -= (gBrt/(eyeSize/2));
      leds[i] = CHSV(gHue, gSat, tempBrt);
    }
  }

  tempBrt = gBrt;
  for( int i = movingled-1; i > (movingled-1)-(eyeSize/2); i-- ) {
    if( i >= 0 ) {
      tempBrt -= (gBrt/(eyeSize/2));
      leds[i] = CHSV(gHue, gSat, tempBrt);
    }
  }
  */
  EVERY_N_MILLISECONDS(speed/2) {

    if( bounceA ) {
      locationA++;
      if( locationA >= (NUM_LEDS - 1) ) {
        bounceA = !bounceA;
      }
    } else {
      if( locationA > 0 ) {
        locationA--;
      }
      if( locationA == 0 ) {
        bounceA = !bounceA;
      }
    }

    black();
    leds[locationA] = CRGB(colorR, colorG, colorB);

    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA+1; k < (locationA+1)+(eyeSize/2); k++) {
      if( k < NUM_LEDS ) {
        tR -= (colorR/(eyeSize/2));
        tG -= (colorG/(eyeSize/2));
        tB -= (colorB/(eyeSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA-1; k > (locationA-1)-(eyeSize/2); k--) {
      if( k >= 0 ) {
        tR -= (colorR/(eyeSize/2));
        tG -= (colorG/(eyeSize/2));
        tB -= (colorB/(eyeSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
  }
} // cylon



void landinglight() {
  //uint8_t numStrobes = 30;                                      // how many strobes do you want?
  uint8_t numStrobes = NUM_LEDS;                                      // how many strobes do you want?
  uint8_t spacing = (NUM_LEDS/numStrobes);
  if (spacing < 1) {
    spacing = 1;
  }
  if (bWipe == 1) {                                             // wipe the display at pattern startup
    black();
    bWipe = 0;
  }

  if (bBounce == 1) {
    black();
    EVERY_N_MILLISECONDS(500) {
      bBounce = 0;
      movingled = 0;
    }
  }

  if (bBounce == 0) {
    black();
    if (movingled < (NUM_LEDS - 1)) {
      leds[movingled] = CRGB::White;
      if ((movingled + spacing) < (NUM_LEDS - 1)) {
        movingled += spacing;
      } else {
        bBounce = 1;
      }
    }
  }
} // landinglight


void pulse() {

  if (bWipe == 1) {                                             // wipe the display
    black();
    bWipe = 0;
  }

  uint8_t BPM = 60;
  uint8_t beat = beatsin8(BPM, 0, 255);
  EVERY_N_MILLISECONDS(100) {
    gHue++;
  }
  if(DEBUG) { Serial.println(beat); }
  for (uint16_t i = 0; i <= ((NUM_LEDS)/2); i++) {
    leds[i] = CHSV(gHue, 255, ((i*beat)/NUM_LEDS)*2);
    leds[(NUM_LEDS-1) - i] = CHSV(gHue, 255, ((i*beat)/NUM_LEDS)*2);
  }
} // pulse()


void racer(void) {

  black();
  uint8_t redBarLength = NUM_LEDS / 8;
  uint8_t blueBarLength = NUM_LEDS / 22;
  uint8_t whiteBarLength = NUM_LEDS / 15;
  uint8_t carSize = NUM_LEDS/30;

  if (bWipe == 1) {                                             // wipe the display and initialize
    black();
    movingled = 0;
    movingledA = 0;
    movingledB = 0;
    movingledC = 0;
    movingledD = 0;
    movingledE = 0;
    movingledF = 0;
    bLed = 0;
    bLedA = 0;
    bLedB = 0;
    bLedC = 0;
    bLedD = 0;
    bLedE = 0;
    bWipe = 0;
    bBounce = 0;
  }


  if (bLedC == 0 && bLedD == 0 && bLedE == 0) {                                     // Start red sequence immediately if none are running          DEBUG FIX!
    bLedC = 1;
  }

  if (bLed == 0) {                                                                  // Start white movingled randomly
    EVERY_N_MILLISECONDS(100) {
      if (random8(1, 100) <= 1) {
        bLed = 1;
      }
    }
  }

  if ((bLedA == 0 && movingledB > NUM_LEDS/4) || (bLedA == 0 && bLedB == 0)) {      // Start blue movingledA
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedA = 1;
      }
    }
  }

  if (bLedB == 0 && movingledA > NUM_LEDS/4) {                                      // Start blue movingledB
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedB = 1;
      }
    }
  }

  if (bLedC == 0 && movingledE > NUM_LEDS/4) {                                      // Start red movingledC
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedC = 1;
      }
    }
  }

    if (bLedD == 0 && movingledC > NUM_LEDS/4) {                                      // Start red movingledD
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedD = 1;
      }
    }
  }

