flying4fun/ESP8266_APA102_chair/src/main.cpp
/*
void lightning(void) {
  //Lightning
  if ( tempPattern == 0 ){ //initialization setup
    strip.setBrightness(50);
    timerA = 0;
    memoryB = memoryA;  //pass the previous program memory out of the loop for future use.
    pulseA = 0;
    bounceA = 0;
    tempPattern = 1;  //lightning mode is temporarily active
  }
  if ( pulseA < 6 ){
    if ( timerA < (millis() - 60 )) {
      if ( bounceA ){
        black();
        bounceA = !bounceA;
      } else {
        for(int k=0; k < (NUMPIXELS); k++) {
          strip.setPixelColor(k, 255, 255, 255);
        }
        bounceA = !bounceA;
        pulseA++;
      }
      timerA = millis();
    }
    strip.show();
  } else {
    strip.setBrightness(brightness);
    programMode = memoryB;
    tempPattern = 0;
  }
}
*/

void burstfade(void) {
  // Burst Fade
  EVERY_N_MILLISECONDS(10) {
    fadeToBlackBy(leds, NUM_LEDS, 10);
  }
  EVERY_N_MILLISECONDS(2200) {
    for(int k=0; k < NUM_LEDS; k++) {
      //strip.setPixelColor(k, gamma8[colorG], gamma8[colorR], gamma8[colorB]);
      leds[k] = CRGB(colorR, colorG, colorB);
    }
  }
}

void dropsfade(void) {
  // Drops Fade
  EVERY_N_MILLISECONDS(10) {
    fadeToBlackBy(leds, NUM_LEDS, 15);
  }
  EVERY_N_MILLISECONDS(600 - (NUM_LEDS*2)) {
    locationA = random(NUM_LEDS-1);
    leds[locationA] = CRGB(colorR, colorB, colorG);
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA+1; k < (locationA+1)+(dropSize/2); k++) {
      if( k < NUM_LEDS ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA-1; k > (locationA-1)-(dropSize/2); k--) {
      if( k >= 0 ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
  }
}

void dropsslide(void) {
  // Drops Slide
  //if( timerB < (millis() - 10)) { //constant fadeout
  EVERY_N_MILLISECONDS(10) { //constant fadeout
    fadeToBlackBy(leds, NUM_LEDS, 20);
    timerB = millis();
  }
  if( bounceA ) {  // write new drop only when old drop is gone
    locationA = random16(1, NUM_LEDS-2);
    //leds[locationA] = CRGB(colorR, colorG, colorB);
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA+1; k < (locationA+1)+(dropSize/2); k++) {
      if( k < NUM_LEDS ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationA-1; k > (locationA-1)-(dropSize/2); k--) {
      if( k >= 0 ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    bounceA = false;
  }
  if( bounceB ) {  // write new drop only when old drop is gone
    locationB = random16(1, NUM_LEDS-2);
    //leds[locationB] = CRGB(colorR, colorG, colorB);
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationB+1; k < (locationB+1)+(dropSize/2); k++) {
      if( k < NUM_LEDS ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    tR = colorR;
    tG = colorG;
    tB = colorB;
    for(int k = locationB-1; k > (locationB-1)-(dropSize/2); k--) {
      if( k >= 0 ) {
        tR -= (colorR/(dropSize/2));
        tG -= (colorG/(dropSize/2));
        tB -= (colorB/(dropSize/2));
        leds[k] = CRGB(tR, tG, tB);
      }
    }
    bounceB = false;
  }
  //if (timerA < (millis() - (50+((NUMPIXELS/2)/((NUMPIXELS/2) > locationA ? (NUMPIXELS/2) - locationA : locationA - (NUMPIXELS/2)))))){ //slide faster when further to the edges - this doesn't work well and crashes sometimes
  EVERY_N_MILLISECONDS(25) {
  //if(timerA < (millis() - 20)) {
    if (locationA > (NUM_LEDS/2)) { //which direction to slide
      if (locationA < NUM_LEDS) {
        locationA++;
      }
      if (locationA == NUM_LEDS) {
        bounceA = true;
      }
    } else {
      if (locationA > 0) {
        locationA--;
      }
      if (locationA == 0) {
        bounceA = true;
      }
    }
    if (locationB > (NUM_LEDS/2)) { //which direction to slide
      if (locationB < NUM_LEDS) {
        locationB++;
      }
      if (locationB == NUM_LEDS) {
        bounceB = true;
      }
    } else {
      if (locationB > 0) {
        locationB--;
      }
      if (locationB == 0) {
        bounceB = true;
      }
    }
    if( locationA  < NUM_LEDS && locationA >= 0) {
      leds[locationA] = CRGB(colorR, colorG, colorB);
    }
    if( locationB  < NUM_LEDS && locationB >= 0) {
      leds[locationB] = CRGB(colorR, colorG, colorB);
    }
    timerA = millis();
  }
}

void Fire2012WithPalette(void) {
  // COOLING: How much does the air cool as it rises?
  // Less cooling = taller flames.  More cooling = shorter flames.
  // Default 55, suggested range 20-100
  #define COOLING  65

  // SPARKING: What chance (out of 255) is there that a new spark will be lit?
  // Higher chance = more roaring fire.  Lower chance = more flickery fire.
  // Default 120, suggested range 50-200.
  #define SPARKING 110

  // Array of temperature readings at each simulation cell
  static byte heat[NUM_LEDS/2];
  static byte heatB[NUM_LEDS/2];

  if (timerA < (millis()-(50-(speed/2)))) {  //reversing the speed slider here, undo if you change the slider.
    black();
    // Step 1.  Cool down every cell a little
    for( int i = 0; i < NUM_LEDS; i++) {
      heat[i] = qsub8( heat[i],  random8(0, ((COOLING * 10) / (NUM_LEDS/2)) + 2));
    }

    // Step 2.  Heat from each cell drifts 'up' and diffuses a little
    for( int k= (NUM_LEDS/2) - 3; k > 0; k--) {
      heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2] ) / 3;
    }

