flying4fun/ESP8266_APA102_chair/src/main.cpp
    // Step 3.  Randomly ignite new 'sparks' of heat near the bottom
    if( random8() < SPARKING ) {
      int y = random8(7);
      heat[y] = qadd8( heat[y], random8(160,255) );
    }

    // Step 4.  Map from heat cells to LED colors
    for( int j = 0; j < (NUM_LEDS/2); j++) {
      // Scale the heat value from 0-255 down to 0-240
      // for best results with color palettes.
      byte colorindex = scale8( heat[j], 240);
      leds[j] = ColorFromPalette( gPal, colorindex);
    }
    //time to do the other side

    // Step 1.  Cool down every cell a little
    for( int i = 0; i < (NUM_LEDS/2); i++) {
     heatB[i] = qsub8( heatB[i],  random8(0, ((COOLING * 10) /
    (NUM_LEDS/2)) + 2));
    }

    // Step 2.  Heat from each cell drifts 'up' and diffuses a little
    //for( int k= (NUM_LEDS/2) - 3; k > 0; k--) {
    for( int k= (NUM_LEDS/2) - 3; k > 0; k--) {
     heatB[k] = (heatB[k - 1] + heatB[k - 2] + heatB[k - 2] ) / 3;
    }

    // Step 3.  Randomly ignite new 'sparks' of heat near the bottom
    if( random8() < SPARKING ) {
     int y = random8(7);
     heatB[y] = qadd8( heatB[y], random8(160,255) );
    }

    // Step 4.  Map from heat cells to LED colors
    int k=0;
    for( int j = (NUM_LEDS-1); j > (NUM_LEDS/2); j--) {  //why doesn't this reverse it?  maybe I know, but it's annoying.
    //for( int j = (NUM_LEDS/2); j < (NUM_LEDS-1); j++) {
      // Scale the heat value from 0-255 down to 0-240
      // for best results with color palettes.
      byte colorindex = scale8( heatB[k], 240);
      k++;
      leds[j] = ColorFromPalette( gPal, colorindex);
    }

    timerA = millis();
  }
}

void risingwater(void) {
  // rising water level (for lack of better name)

  if( timerA < (millis() - (speed/4))) {
    if( locationA >= (NUM_LEDS/2) ) {
      locationA = 0;
      bBounce = !bBounce;
    } else {
      locationA++;
    }

    if( bBounce ) {
      black();
      for( int i=0; i <= locationA; i++ ) {
        leds[i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        if( i >= (NUM_LEDS/2) ) {
          leds[NUM_LEDS] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        } else {
          leds[NUM_LEDS-i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        }
      }
    } else {
      black();
      for( int i=locationA; i <= (NUM_LEDS/2); i++ ) {
        leds[i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        if( i >= (NUM_LEDS/2) ) {
          leds[NUM_LEDS] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        } else {
          leds[NUM_LEDS-i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        }
      }
    }

    timerA = millis();
  }
}

void fallingwater(void) {

  // opposite of rising water level (for lack of better name)

  if( timerA < (millis() - (speed/4))) {
    if( locationA > 0 ) {
      locationA--;
    } else {
      locationA = (NUM_LEDS/2);
      bBounce = !bBounce;
    }

    if( bBounce ) {
      black();
      for( int i=NUM_LEDS/2; i >= locationA; i-- ) {
        leds[i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        if( i >= (NUM_LEDS/2) ) {
          leds[NUM_LEDS] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        } else {
          leds[NUM_LEDS-i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        }
      }
    } else {
      black();
      for( int i=locationA; i >= 0; i-- ) {
        leds[i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        if( i >= (NUM_LEDS/2) ) {
          leds[NUM_LEDS] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        } else {
          leds[NUM_LEDS-i] = CRGB( gamma8[colorR], gamma8[colorG], gamma8[colorB] );
        }
      }
    }

    timerA = millis();
  }
}
